FAILED_ERROR_LOGIN = "Неудачная попытка входа."

EMAIL_ERROR = "Email должен состоять из символа @, а так же иметь домен"
FULLNAME_ERROR = ("Поле должно содержать хотя бы 2 символа до 50 символов, "
                  "только латинские буквы и начинаться с большой буквы, затем строчные.")
PHONE_ERROR = "Phone должен содержать 11 цифр и начинаться с 7 или 8"

PASSWORD_LENGTH_ERROR = "Длина пароля должна быть от 8 до 50 символов."
PASSWORD_UPPERCASE_ERROR = "В пароле должна быть хотя бы одна заглавная буква."
PASSWORD_LOWERCASE_ERROR = "В пароле должна быть хотя бы одна строчная буква."
PASSWORD_DIGIT_ERROR = "В пароле должна быть хотя бы одна цифра."
PASSWORD_SPECIAL_CHAR_ERROR = r"В пароле должен быть хотя бы один специальный символ !@#$%^&{}()\[]-_=+;:,<.>|/?."

USERNAME_ERROR = ("Поле 'username' должно содержать хотя бы 2 символа, "
                  "только латинские буквы и начинаться с большой буквы, затем строчные.")

